Задача №1 
Вход: имя (Мужик ) Возраст (100)
Выход: Здравствуйте,  Мужик 100
a = 20
b = 10 
print('a + b =', a + b)
print('a - b =', a - b)
print('a * b =', a * b)

#Важный момент
print(a + 1)  # out: 10
print(a)  # out: 5

### Синтаксический сахар
a = a + 1  # a += 1
print('a =', a)
a += 1  # a = a + 1
print('a +=', a)
a -= 2  # a = a - 2
print('a -=', a)

# Длинная арифметика
a **= 450
print(a)
# 
print(float('inf'))  ## Плюс бесконечность. Самое большое число
print(float('-inf')) ## Минус бесконечность. Самое маленькое число

## Важный момент хранение дробных чисел в памяти компьютера
# a = 0.6
# if a * 6 == 0.12:
#     print('Все хорошо')
# else:
#     print('Ничего не понятно!')
