

a = 5
b = 10
print ('a + b =', a + b)
print ('b - a =', b - a)
print ('b / a =', b / a)
print ('a * b =', a * b)
print ( 'Извлечение квадрата с помощью модуля math =% 7.3f'  %  math . sqrt ( a ))   # то же самое

# Важный момент 
print (a + 2) #выход: 2
print ( a ) #out: 5

# Синтаксический сахар
a = a + 5 # a + = 5
print ( 'а =' , а )
b = b + 10 # b + = 10
print ( 'b =' , b )
a / a + 5 # a + = 5
print ( 'a =' , a )
b * b + 5 # b + = 105

#Длинная арифметика
а  ** =  250
печать ( а )
# 
print ( float ( 'inf' ))   ## Плюс бесконечность. Самое большое число
print ( float ( '-inf' )) ## Минус бесконечность. Самое маленькое число

## Важный момент хранения дробных чисел в памяти компьютера
a = 0,5
если a * 5 == 0,25
print ('Всё хорошо')
else:
print ('Всё плохо ')
